
&ИзменениеИКонтроль("ВыгрузитьДанные")
Процедура Расш1_ВыгрузитьДанные()

	Каталог = Константы.Каталог.Получить();
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Справочник1.Ссылка.Наименование КАК Наименование,
	|	Справочник1.Реквизит1 КАК Реквизит1,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Справочник1.Ссылка) КАК Гуид
	|ИЗ
	|	Справочник.Справочник1 КАК Справочник1";

	РезультатТЗ = Запрос.Выполнить().Выгрузить();

	ТекДатаСтрока = Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");

	ФайлJSON = СтрШаблон("%1%2.json", Каталог, ТекДатаСтрока);
	ЗаписьФайла = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьФайла.ОткрытьФайл(ФайлJSON,,,ПараметрыЗаписи);

	ЗаписьФайла.ЗаписатьНачалоМассива();	
	Для Каждого Элем Из РезультатТЗ Цикл
		ЗаписьФайла.ЗаписатьНачалоОбъекта();
		Для Каждого ЭлемКолонка Из РезультатТЗ.Колонки Цикл
			ЗаписьФайла.ЗаписатьИмяСвойства(ЭлемКолонка.Имя);
			ЗаписьФайла.ЗаписатьЗначение(Строка(Элем[ЭлемКолонка.Имя]));
		КонецЦикла;
		ЗаписьФайла.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьФайла.ЗаписатьКонецМассива();

	ЗаписьФайла.Закрыть();

КонецПроцедуры
