// главный метод тестового набора, здесь необходимо будет перечислить тесты, которые содержит модуль.
Процедура ИсполняемыеСценарии() Экспорт  
			
	ЮТТесты	
        .ДобавитьТест("Сложение")
            .СПараметрами(2, 3, 5)
            .СПараметрами(2, -3, -1)
            .СПараметрами("2", "-3", "2-3")
            .СПараметрами("2", -3, "2-3") 
		
    ;
КонецПроцедуры  

Процедура Сложение(ПервыйОперанд, ВторойОперанд, Результат) Экспорт

    РезультатСложения = ПервыйОперанд + ВторойОперанд;
    ЮТест.ОжидаетЧто(РезультатСложения)
        .Заполнено()
        .ИмеетТип("Число, Строка")
        .Равно(Результат);

КонецПроцедуры 
	