
&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере()
	
	ФоновыеЗаданияТест.ВыгрузитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере()
	
	ФоновыеЗаданияТест.ЗагрузитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Каталог = "D:\ТестОбмена\";
	
	//Установка ГУИДа нового элемента.
	//НовыйЭлемент = Справочники.Проекты.СоздатьЭлемент();
	//НовыйЭлемент.УстановитьСсылкуНового(Ссылка_Которой_НЕТ);
	//НовыйЭлемент.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьВозможностьПримененияРасширенийНаСервере(МассивОшибок = Неопределено)
	Если не ЗначениеЗаполнено(МассивОшибок) Тогда
		МассивОшибок = Новый Массив();		
	КонецЕсли;
	
	МассивОшибокНаСервере = РасширенияКонфигурации.ПроверитьВозможностьПримененияВсех();
	Для Каждого Элем Из МассивОшибокНаСервере Цикл 
		ЭлементМассива = Новый Структура("Важность, Описание, Расширение");
		ЭлементМассива.Важность = Строка(Элем.Важность);
		ЭлементМассива.Описание = Элем.Описание;
		ЭлементМассива.Расширение = Элем.Расширение.Имя;
		МассивОшибок.Добавить(ЭлементМассива);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьПримененияРасширений(Команда)
	МассивОшибок = Новый Массив();
	ПроверитьВозможностьПримененияРасширенийНаСервере(МассивОшибок);
	
	СообщениеП = Новый СообщениеПользователю;
	Если МассивОшибок.Количество() = 0 Тогда
		СообщениеП.Текст = "Ошибок применения расширений не обнаружено.";
		СообщениеП.Сообщить();
	Иначе
		Для Каждого СообщениеОбОшибке Из МассивОшибок Цикл
			СообщениеП.Текст = СтрШаблон("В расширении %1 возникла следующая ошибка: %2.", 
				СообщениеОбОшибке.Расширение, СообщениеОбОшибке.Описание);
			СообщениеП.Сообщить();		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
