&НаСервереБезКонтекста
Процедура ПроверитьВозможностьПримененияРасширенийНаСервере(МассивОшибок = Неопределено)
	Если не ЗначениеЗаполнено(МассивОшибок) Тогда
		МассивОшибок = Новый Массив();		
	КонецЕсли;
	
	МассивОшибокНаСервере = РасширенияКонфигурации.ПроверитьВозможностьПримененияВсех();
	Для Каждого Элем Из МассивОшибокНаСервере Цикл 
		ЭлементМассива = Новый Структура("Важность, Описание, Расширение");
		ЭлементМассива.Важность = Строка(Элем.Важность);
		ЭлементМассива.Описание = Элем.Описание;
		ЭлементМассива.Расширение = Элем.Расширение.Имя;
		МассивОшибок.Добавить(ЭлементМассива);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьПримененияРасширений(Команда)
	МассивОшибок = Новый Массив();
	СообщенияОбОшибкахПрименения = "";
	ТекстЗаявки = "";
	ГруппаРезультатЗаголовок = "";
	СообщениеУспешногоРезультата = "Ошибок применения расширений не обнаружено.";
	СообщениеНеудачногоРезультата = "При проверке возможности применения расширений возникли ошибки.";
	ГруппаРезультатЦветФона = Новый Цвет();
	
	ПроверитьВозможностьПримененияРасширенийНаСервере(МассивОшибок);
	НетОшибок = (МассивОшибок.Количество() = 0); 
	
	Элементы.ТекстЗаявки.Видимость = НетОшибок;
	
	СообщениеП = Новый СообщениеПользователю;
	
	Если НетОшибок Тогда
		СообщениеП.Текст = СообщениеУспешногоРезультата; 
		СообщенияОбОшибкахПрименения = СообщениеУспешногоРезультата; 
		ТекстЗаявки = СтрШаблон("Шаблон текста заявки%1.", "");
		ГруппаРезультатЗаголовок = СообщениеУспешногоРезультата;
		ГруппаРезультатЦветФона = Новый Цвет(200, 255, 200);
	Иначе 
		СообщениеП.Текст = СообщениеНеудачногоРезультата; 
		ГруппаРезультатЗаголовок = СообщениеНеудачногоРезультата;
		ГруппаРезультатЦветФона = Новый Цвет(255, 200, 200);
		Для Каждого СообщениеОбОшибке Из МассивОшибок Цикл
			СообщенияОбОшибкахПрименения = СтрШаблон("В расширении %1 возникла следующая ошибка: %2.%3", 
				СообщениеОбОшибке.Расширение, СообщениеОбОшибке.Описание, Символы.ПС); 
		КонецЦикла; 
	КонецЕсли;
	СообщениеП.Сообщить();
	
	Элементы.ГруппаРезультат.Заголовок = ГруппаРезультатЗаголовок; 
	Элементы.ГруппаРезультат.ЦветФона = ГруппаРезультатЦветФона; 
	
КонецПроцедуры
